Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor
The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor class provides a conversion method for converting a Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs instance
to a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs)
Converts an instance of Tekla.BIM.DirectManipulation.Services.Toleration.TolerationEventArgs to an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.
e: The event data to convert.
Returns: The converted event data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedPoint)
Converts an instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedPoint to an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t.
point: The tolerated point to convert.
Returns: The converted tolerated point.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject)
Converts an instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject to an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t.
toleratedObject: The tolerated object to convert.
Returns: The converted tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine)
Converts an instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine to an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t.
toleratedLine: The tolerated line to convert.
Returns: The converted tolerated line.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor.Convert(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace)
Converts an instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace to an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t.
tolerationData: The tolerated face to convert.
Returns: The converted tolerated face.